<section class="section--light features">
    <div class="container">
        <div class="page__subtitle text-center">Особенности автономных солнечных электростанций</div>
        <div class="features__row">
            <div class="features__picture">
                <img class="lazy" data-src="static/images/common/pic_features.jpg" src="data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==" alt="image" title="title" />
            </div>
            <div class="features__content">
                <p>Сетевая солнечная электростанция&nbsp;&mdash; это набор оборудования, включающий фотоэлектрические модули, преобразователь, контроллер и&nbsp;другие сопутствующие товары*, необходимые для организации СЭС. Сетевая солнечная электростанция не&nbsp;снабжена
                    аккумуляторными батареями, поэтому предназначена исключительно для питания объектов, подключенных к&nbsp;централизованной сети. Питание объекта от&nbsp;СЭС осуществляется по&nbsp;приоритетной схеме: вся вырабатываемая солнечная энергия идет на&nbsp;покрытие
                    потребностей объекта, а&nbsp;в&nbsp;случае нехватки вырабатываемой энергии (в&nbsp;условиях недостаточности солнца или в&nbsp;ночное время) система &laquo;добирает&raquo; необходимую мощность из&nbsp;центральной сети. При отсутствии потребления
                    в&nbsp;доме или при выработке солнечной установкой излишней электроэнергии, последняя будет отдаваться в&nbsp;сеть, при этом согласно принятому ФЗ &#8470;&nbsp;35&nbsp;&laquo;Об&nbsp;электроэнергетике&raquo; энергосбытовая компания обязана будет
                    купить эти излишки у&nbsp;владельца электростанции по&nbsp;заранее установленному специальному тарифу.</p>
            </div>
        </div>
    </div>
</section>